---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisResultSchema Constructor
AnalysisResultSchema Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisResultSchema(AnalysisResultSchema) | Constructs a new copy of the input AnalysisResultSchema object. |
|  | AnalysisResultSchema(String, String) | Creates object and assigns name and description |

# See Also

AnalysisResultSchema Class

AnalysisResultSchema Members

Autodesk.Revit.DB.Analysis Namespace